Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1 class represents the tolerated object.
The type of the tolerated object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1.#ctor(`0,Tekla.Common.Geometry.Vector3)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1 class.
target: The target.
hitPoint: The hit point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1.Object
Gets the tolerated object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitObject`1.HitPoint
Gets the hit point.